# """Двоичный поиск."""
#
# from random import randint
#
# # Лист рандомных значений:
# random_list = [randint(1, 50) for i in range(15)]
#
# # Сортируем в порядке возрастания:
# random_list.sort()
# # Выводим отсортированный список:
# print(random_list)
#
# # Искомое число:
# value = int(input())
#
# # Изначальная середина массива (индекс):
# mid = len(random_list) // 2
#
# # Нижняя граница массива (индекс):
# low = 0
#
# # Верхняя граница массива (индекс):
# high = len(random_list) - 1
#
# # Пока индекс среднего числа не равен загадонному значению и нижняя граница
# # Меньше или не равна верхней границе:
# while random_list[mid] != value and low <= high:
#     # Если значение больше нынешней середины, нет смысла проверяет меньшие
#     # значения, отсекаем low границу:
#     if value > random_list[mid]:
#         low = mid + 1
#     # Если значение меньше нынешней середины, нет смысла проверять бОльшие
#     # числа, отсекаем high границу:
#     else:
#         high = mid - 1
#     # Переносим середину что бы "менять" длинну массива (не фактически):
#     mid = (low + high) // 2
# # Если нижняя граница стала больше верхней значит числа нет:
# if low > high:
#     print('Загадоного числа в списке нет!')
# # Иначе распечатаем искомое число и его индекс:
# else:
#     print(f'Загадано число {value} его индекс в массиве {mid


